## `./`
#### Terraform Format and Style 🖌`failure`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=776138695608]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_policy.app_policy will be created
  + resource "aws_iam_policy" "app_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for app"
      + id               = (known after apply)
      + name             = "myapp"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ap-northeast-1:776138695608:log-group:/aws/amplify/*:log-stream:*"
                      + Sid      = "PushLogs"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ap-northeast-1:776138695608:log-group:/aws/amplify/*"
                      + Sid      = "CreateLogGroup"
                    },
                  + {
                      + Action   = [
                          + "logs:DescribeLogGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ap-northeast-1:776138695608:log-group:*"
                      + Sid      = "DescribeLogGroups"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CreatedByRole" = "terraform"
          + "Description"   = "Maneged by terraform"
          + "Service"       = "app"
        }
    }

  # aws_iam_role.app_role will be created
  + resource "aws_iam_role" "app_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "amplify.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CreatedByRole" = "terraform"
          + "Description"   = "Maneged by terraform"
          + "Service"       = "app"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.app_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "app_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "app_role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>